// i	忽略大小写匹配
// g	全局匹配，即是匹配一个后继续匹配，直到结束
// m	多行匹配，即是遇到换行后不停止匹配，直到结束

// ● [a-z] 表示从小写字母a到小写字母z之间的任意字符(含a和z)，下文会有详细说明
// ● + 表示至少出现一次
// ● \n 在js中表示换行
// ● 1.^[]匹配以字符串开头的  2.[^a-z]匹配除开a-z的字符
// 'aBcd efg'.match(/[a-z]+/); //[a]
// 'aBcd efg'.match(/[a-z]+/i); //[aBcd]
// 'aBcd efg'.match(/[a-z]+/g); //[a , cd , efg]
// 'aBcd efg'.match(/[a-z]+/gi); //[aBcd , efg]
// 'aB\ncd\n efg'.match(/^[a-z]+/m); //[a]   
// 'aB\ncd\n efg'.match(/^[a-z]+/g); //[a]
// 'aB\ncd\n efg'.match(/^[a-z]+/gm); //[a ,cd ,efg ]

// console.log('adobe2016'.match(/^[a-zA-Z]+/g)); //[adobe];
// 在正则 或 匹配中(即 | 匹配)，表示 或者以某某字符开始的字符串，如下表示匹配 连续数字 或 以小写字母开头且连续为小写字母的字符串
// console.log('dobe2016ps'.match(/\d+|^[a-z]+/g)); //[adobe , 2016 ]
// 在 [] 内开始位置时，表示不匹配 [] 内除 ^ 以外的所有字符：
// 'adobe'.match(/[^abc]/g); //[d,o,e]
// $ 与 ^ 的前两个用法相似，只不过匹配的是以某某字符结尾的字符串
// 'adobe 2016'.match(/\d+|[a-z]+$/g); //[2016]
// 'adobe'.match(/\d+|[a-z]+$/g); //[adobe]
// - (连字符)表示左边字符的 ASCII 值到右边字符 ASCII 编码值之间及左右字符自身的所有字符
// 'adobe PS 2016'.match(/[a-g]/g);

// console.log('1+0.2*2=1.4'.match(/.{5}/g)) ;

//詹前
'@1@2@3@123'.replace(/@(?=\d{2,})/g , 'f')
//顾后
'@1@2T3Y4'.replace(/(?<=\d)\w/g , 'r')
// 负前瞻：
// exp1(?!exp2) 查找后面不是exp2的exp1
// 负后顾：
// (?<!=exp2)exp1 查找前面不是exp2的exp1

// 验证数字：^[0-9]*$  
// 验证n位的数字：^\d{n}$ 
// 验证至少n位数字：^\d{n,}$ 
// 验证m-n位的数字：^\d{m,n}$ 
// 验证零和非零开头的数字：^(0|[1-9][0-9]*)$ 
// 验证有两位小数的正实数：^[0-9]+(.[0-9]{2})?$ 
// 验证有1-3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$ 
// 验证非零的正整数：^\+?[1-9][0-9]*$ 
// 验证非零的负整数：^\-[1-9][0-9]*$ 
// 验证非负整数（正整数 + 0）： ^\d+$ 
// 验证非正整数（负整数 + 0）： ^((-\d+)|(0+))$ 
// 验证长度为3的字符：^.{3}$ 
// 验证由26个英文字母组成的字符串：^[A-Za-z]+$ 
// 验证由26个大写英文字母组成的字符串：^[A-Z]+$ 
// 验证由26个小写英文字母组成的字符串：^[a-z]+$ 
// 验证由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$ 
// 验证由数字、26个英文字母或者下划线组成的字符串：^\w+$ 
// 验证用户密码：^[a-zA-Z]\w{5,17}$     正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。 
// 验证是否含有 ^%&',;=?$\" 等字符：[^%&',;=?$\x22]+ 
// 验证汉字：^[\u4e00-\u9fa5],{0,}$ 
// 验证Email地址：/^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/
// 验证InternetURL：^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$ 
// 验证电话号码：^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$：   --正确格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。 
// 验证身份证号（15位或18位数字）：^\d{15}|\d{}18$ 
// 验证一年的12个月：^(0?[1-9]|1[0-2])$ 正确格式为：“01”-“09”和“1”“12” 
// 验证一个月的31天：^((0?[1-9])|((1|2)[0-9])|30|31)$ 正确格式为：01、09和1、31。 
// 整数：^-?\d+$ 
// 非负浮点数（正浮点数 + 0）：^\d+(\.\d+)?$ 
// 正浮点数： ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$ 
// 非正浮点数（负浮点数 + 0）： ^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 
// 负浮点数 ：^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$ 
// 浮点数： ^(-?\d+)(\.\d+)?$